app/controllers/invoices_controller.rb

  def pdf
    @debug = params[:preview]
    @invoice = Invoice.find(params[:id])
    @client = @invoice.client

    @factura_header = @client.name + "\n"
    @factura_header << @client.direccion + "\n" unless @client.direccion.blank?
    @factura_header << @client.cp + " " unless @client.cp.blank?
    @factura_header << @client.localidad + " " unless @client.localidad.blank?
    @factura_header << @client.provincia + " " unless @client.provincia.blank?

    if @client.remito_direccion.blank?
      @remito_header = @factura_header
    else
      @remito_header = @client.name + "\n" + @client.remito_direccion + "\n"
      @remito_header << @client.remito_cp + " " unless @client.remito_cp.blank?
      @remito_header << @client.remito_localidad + " " unless @client.remito_localidad.blank?
      @remito_header << @client.remito_provincia + " " unless @client.remito_provincia.blank?
    end


    @products = @invoice.invoice_products.map do |ip|
---
SELECT * FROM `invoices` WHERE (`invoices`.`id` = 5)
SELECT * FROM "clients" WHERE ("clients"."id" = 137)
SELECT * FROM `invoice_products` WHERE (`invoice_products`.invoice_id = 5)
SELECT * FROM `products` WHERE (`products`.`id` = 40)